# Data ingestion and inspection

In [20]:
# Indexes and columns

import pandas as pd

AAPL = pd.read_csv('./datasets/AAPL.csv')

type(AAPL)

pandas.core.frame.DataFrame

In [21]:
AAPL.shape

(378, 6)

In [22]:
AAPL.columns

Index(['date', 'close', 'volume', 'open', 'high', 'low'], dtype='object')

In [23]:
type(AAPL.columns)

pandas.core.indexes.base.Index

In [24]:
AAPL.index

RangeIndex(start=0, stop=378, step=1)

In [25]:
type(AAPL.index)

pandas.core.indexes.range.RangeIndex

In [26]:
# Slicing
AAPL.iloc[:5,:]

         date   close         volume    open     high       low
0       11:41  174.27     15,925,321  172.93  175.080  172.3501
1  2019/02/04  171.25  31384720.0000  167.41  171.655  167.2800
2  2019/02/01  166.52  32644590.0000  166.96  168.980  165.9300
3  2019/01/31  166.44  40613260.0000  166.11  169.000  164.5600
4  2019/01/30  165.25  60800480.0000  163.25  166.150  160.2300

In [27]:
# Slicing
AAPL.iloc[-5:,:]

           date   close         volume    open    high       low
373  2017/08/10  155.32  39636190.0000  159.90  160.00  154.6300
374  2017/08/09  161.06  26060430.0000  159.26  161.27  159.1100
375  2017/08/08  160.08  36127490.0000  158.60  161.83  158.2700
376  2017/08/07  158.81  21827400.0000  157.06  158.92  156.6701
377  2017/08/04  156.39  20514810.0000  156.07  157.40  155.6900

In [28]:
# head()
AAPL.head(5)

         date   close         volume    open     high       low
0       11:41  174.27     15,925,321  172.93  175.080  172.3501
1  2019/02/04  171.25  31384720.0000  167.41  171.655  167.2800
2  2019/02/01  166.52  32644590.0000  166.96  168.980  165.9300
3  2019/01/31  166.44  40613260.0000  166.11  169.000  164.5600
4  2019/01/30  165.25  60800480.0000  163.25  166.150  160.2300

In [29]:
AAPL.head(2)

         date   close         volume    open     high       low
0       11:41  174.27     15,925,321  172.93  175.080  172.3501
1  2019/02/04  171.25  31384720.0000  167.41  171.655  167.2800

In [30]:
# tail()
AAPL.tail()

           date   close         volume    open    high       low
373  2017/08/10  155.32  39636190.0000  159.90  160.00  154.6300
374  2017/08/09  161.06  26060430.0000  159.26  161.27  159.1100
375  2017/08/08  160.08  36127490.0000  158.60  161.83  158.2700
376  2017/08/07  158.81  21827400.0000  157.06  158.92  156.6701
377  2017/08/04  156.39  20514810.0000  156.07  157.40  155.6900

In [31]:
AAPL.tail(3)

           date   close         volume    open    high       low
375  2017/08/08  160.08  36127490.0000  158.60  161.83  158.2700
376  2017/08/07  158.81  21827400.0000  157.06  158.92  156.6701
377  2017/08/04  156.39  20514810.0000  156.07  157.40  155.6900

In [32]:
# info()
AAPL.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 378 entries, 0 to 377
Data columns (total 6 columns):
date      378 non-null object
close     378 non-null float64
volume    378 non-null object
open      378 non-null float64
high      378 non-null float64
low       378 non-null float64
dtypes: float64(4), object(2)
memory usage: 17.8+ KB

In [33]:
# Broadcasting
import numpy as np

AAPL.iloc[::3,-1] = np.nan

In [34]:
AAPL.head(6)

         date   close         volume    open     high     low
0       11:41  174.27     15,925,321  172.93  175.080     NaN
1  2019/02/04  171.25  31384720.0000  167.41  171.655  167.28
2  2019/02/01  166.52  32644590.0000  166.96  168.980  165.93
3  2019/01/31  166.44  40613260.0000  166.11  169.000     NaN
4  2019/01/30  165.25  60800480.0000  163.25  166.150  160.23
5  2019/01/29  154.68  39914850.0000  156.25  158.130  154.11

In [35]:
AAPL.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 378 entries, 0 to 377
Data columns (total 6 columns):
date      378 non-null object
close     378 non-null float64
volume    378 non-null object
open      378 non-null float64
high      378 non-null float64
low       252 non-null float64
dtypes: float64(4), object(2)
memory usage: 17.8+ KB

In [36]:
# Series

low = AAPL['low']

type(low)

pandas.core.series.Series

In [37]:
low.head()

0       NaN
1    167.28
2    165.93
3       NaN
4    160.23
Name: low, dtype: float64

In [39]:
lows = low.values
type(lows)

numpy.ndarray